app/Controllers/Backend/Form.php

SELECT *
FROM `forms`
WHERE `forms`.`id` = '3'
---
    public function getFormData()
    {
        $json = $this->request->getJSON();
        $id = $json->id ?? null;
        if (!$id) {
            return $this->failNotFound('No ID provided');
        }

        $formData = $this->formModel->find($id);